/****************************************************************
*	[功能描述]
*	TCP套接字类,继承自BaseSocket类
*	作者:QianLong 
*	时间:2014-10-04
*	版本:V1.0
*
*****************************************************************
*				QL All Rights Reserved
****************************************************************/

#pragma once

#include "stdafx.h"
#include "CBaseSocket.h"

namespace QianLong{
	class TcpSocket : public BaseSocket{
	public:
		TcpSocket();
		virtual ~TcpSocket();

		/************************************************************************/
		/* 监听封装函数,可选是否地址复用                                        */
		/************************************************************************/
		virtual errno_t Listen(const string &strLocalIP /* = "ANY" */, 
							   const USHORT usPort /* = 8888 */, 
							   const USHORT usListenNums /* = 5 */, 
							   const bool bReuseAddr /* = false */);

		/************************************************************************/
		/* 监听端的接受连接封装函数,可选是否记录对端地址信息                    */
		/************************************************************************/
		virtual errno_t Accept(const bool bPeerAddr /* = true */);

		/************************************************************************/
		/* 阻塞式连接函数的封装函数                                             */
		/************************************************************************/
		virtual errno_t SYNCConnect(const string strPeerIP /* = "127.0.0.1" */, 
									const USHORT usPort /* = 8888 */);

		/************************************************************************/
		/* 非阻塞式连接函数的封装函数                                           */
		/************************************************************************/
		virtual errno_t ASYNCConnect(const string strPeerIP /* = "127.0.0.1" */, 
									 const USHORT usPort /* = 8888 */, 
									 const USHORT usWaitTime /* = 5 */);

		/************************************************************************/
		/* 发送命令,命令长度不得超过128字节                                     */
		/************************************************************************/
		virtual errno_t SendCommand(const string &strCom);

		/************************************************************************/
		/* 接收命令,命令长度不得超过128字节                                     */
		/************************************************************************/
		virtual errno_t RecvCommand(string &strCom);

		/************************************************************************/
		/* 发送长命令                                                           */
		/************************************************************************/
		virtual errno_t SendLongCommand(const string &strCom);

		/************************************************************************/
		/* 发送文件,可选文件是否以二进制打开                                    */
		/************************************************************************/
		virtual errno_t SendFile(const string &strFilePath, const bool bBinary /* = true */);

		/************************************************************************/
		/* 接收文件,可选文件是否以二进制打开                                    */
		/************************************************************************/
		virtual errno_t RecvFile(const string &strFilePath, const bool bBinary /* = true */);

		/************************************************************************/
		/* 获取本机IP,结果以vector<string>的格式返回                            */
		/************************************************************************/
		virtual errno_t GetLocalIP(vector<string> &strLocalIP);

		/************************************************************************/
		/* 获取连接成功的本地IP                                                 */
		/************************************************************************/
		virtual errno_t GetConnectedLocalAddr(string &strLocalIP,USHORT &usPort);
	};
}